In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
data = {
    'A': [1,2,3,4] ,# INTEGER COLUMN
    'B':[2.5,3.5,4.5,5.5] , # FLOAT COLUMN
    'C':['6', '7', '8','9'] # string column representing integers
}

In [7]:
df = pd.DataFrame(data)

In [9]:
# Running info methods  give datatype descriptions
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      float64
 2   C       4 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

In [11]:
# First head rows
df.head()

   A    B  C
0  1  2.5  6
1  2  3.5  7
2  3  4.5  8
3  4  5.5  9

In [17]:
df.dtypes

A      int64
B    float64
C     object
dtype: object

In [21]:
# calculating the column datatype as object is having different things
type(df['C'].iloc[0])

str

In [25]:
# Chage datatypes with astype
# Convert data types
df["A"] = df["A"].astype(float)
df["B"] = df["B"].astype(str)
df["C"] = df["C"].astype(int)

In [27]:
print(df)

     A    B  C
0  1.0  2.5  6
1  2.0  3.5  7
2  3.0  4.5  8
3  4.0  5.5  9

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      object
 2   C       4 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

In [33]:
df.dtypes

A    float64
B     object
C      int64
dtype: object

pd.to_numeric  function allow error handling during conversion
arg
errors
raise: throw an error
cohersion : Invalid parse as NAN

In [84]:
data ={
    "A" :[1,'2', "goodbye", '4.0',5.5]
}

In [86]:
df = pd.DataFrame(data)

In [88]:
df

         A
0        1
1        2
2  goodbye
3      4.0
4      5.5

In [90]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      object
dtypes: object(1)
memory usage: 172.0+ bytes

In [92]:
df["A"].astype(float)

ValueError: could not convert string to float: 'goodbye'

In [100]:
type(df["A"].iloc[1])

str

In [70]:
type(df["A"])

pandas.core.series.Series

In [72]:
df["A"] = pd.to_numeric(df["A"], errors='coerce')

In [74]:
df

     A
0  1.0
1  2.0
2  NaN
3  4.0
4  5.5

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
dtypes: float64(1)
memory usage: 172.0 bytes

In [78]:
df["B"] = pd.to_numeric(df["A"], errors='coerce')

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      float64
dtypes: float64(2)
memory usage: 212.0 bytes

In [102]:
df_mixed = pd.DataFrame(
    {
        'int_colmn' : [1,2,3,4],
        "float_column" : [1.0,2.0,3.0,4.0],
        "string_col" : ['1','2','3', '6']
    }
)

df_optimised = pd.DataFrame(
    {
        'int_colmn' : [1,2,3,4],
        "float_column" : [1.0,2.0,3.0,4.0],
        "string_col" : [1,2,3,6]
    }
)

In [113]:
print("Memory Usage")

print("Mixed types",df_mixed.memory_usage(deep = True).sum())
print("Optmised types",df_optimised.memory_usage(deep = True).sum())


print("Performance")
%timeit df_mixed["int_colmn"]+ df_mixed["float_column"] + df_mixed["string_col"].astype(float)
%timeit df_optimised["int_colmn"]+ df_mixed["float_column"] + df_mixed["string_col"].astype(float)

Memory Usage
Mixed types 428
Optmised types 228
Performance
64.8 µs ± 296 ns per loop (mean ± std. dev. of 7 runs, 10,000 loops each)
65.2 µs ± 145 ns per loop (mean ± std. dev. of 7 runs, 10,000 loops each)

In [191]:
data ={

    'Text':["Hello_World", "Python$pandas", "  Datascience is cool !!!", "Machine-Learning"]
}

In [193]:
df =  pd.DataFrame(data)
df

                        Text
0                Hello_World
1              Python$pandas
2    Datascience is cool !!!
3           Machine-Learning

In [195]:
df["lower"]= df["Text"].str.lower()
df

                        Text                      lower
0                Hello_World                hello_world
1              Python$pandas              python$pandas
2    Datascience is cool !!!    datascience is cool !!!
3           Machine-Learning           machine-learning

In [197]:
df["Upper"] = df["Text"].str.upper()
df

,Text,lower,Upper
0,Hello_World,hello_world,HELLO_WORLD
1,Python$pandas,python$pandas,PYTHON$PANDAS
2,Datascience is cool !!!,datascience is cool !!!,DATASCIENCE IS COOL !!!
3,Machine-Learning,machine-learning,MACHINE-LEARNING

In [199]:
df["capitalise"]= df["Text"].str.capitalize()
df

,Text,lower,Upper,capitalise
0,Hello_World,hello_world,HELLO_WORLD,Hello_world
1,Python$pandas,python$pandas,PYTHON$PANDAS,Python$pandas
2,Datascience is cool !!!,datascience is cool !!!,DATASCIENCE IS COOL !!!,datascience is cool !!!
3,Machine-Learning,machine-learning,MACHINE-LEARNING,Machine-learning

In [201]:
df["Title"] = df["Text"].str.title()
df

,Text,lower,Upper,capitalise,Title
0,Hello_World,hello_world,HELLO_WORLD,Hello_world,Hello_World
1,Python$pandas,python$pandas,PYTHON$PANDAS,Python$pandas,Python$Pandas
2,Datascience is cool !!!,datascience is cool !!!,DATASCIENCE IS COOL !!!,datascience is cool !!!,Datascience Is Cool !!!
3,Machine-Learning,machine-learning,MACHINE-LEARNING,Machine-learning,Machine-Learning

In [245]:
# Match record
df["Text"].str.match("Machine")

0    False
1    False
2    False
3     True
Name: Text, dtype: bool

In [241]:
searchfor = ['cool', 'learn']
df["Text"].str.contains('|'.join(searchfor))

0    False
1    False
2     True
3    False
Name: Text, dtype: bool

In [207]:
df["strip"] =  df["Text"].str.strip()
df

,Text,lower,Upper,capitalise,Title,strip
0,Hello_World,hello_world,HELLO_WORLD,Hello_world,Hello_World,Hello_World
1,Python$pandas,python$pandas,PYTHON$PANDAS,Python$pandas,Python$Pandas,Python$pandas
2,Datascience is cool !!!,datascience is cool !!!,DATASCIENCE IS COOL !!!,datascience is cool !!!,Datascience Is Cool !!!,Datascience is cool !!!
3,Machine-Learning,machine-learning,MACHINE-LEARNING,Machine-learning,Machine-Learning,Machine-Learning

In [209]:
df["split"] =df["Text"].str.split()
df

,Text,lower,Upper,capitalise,Title,strip,split
0,Hello_World,hello_world,HELLO_WORLD,Hello_world,Hello_World,Hello_World,[Hello_World]
1,Python$pandas,python$pandas,PYTHON$PANDAS,Python$pandas,Python$Pandas,Python$pandas,[Python$pandas]
2,Datascience is cool !!!,datascience is cool !!!,DATASCIENCE IS COOL !!!,datascience is cool !!!,Datascience Is Cool !!!,Datascience is cool !!!,"[Datascience, is, cool, !!!]"
3,Machine-Learning,machine-learning,MACHINE-LEARNING,Machine-learning,Machine-Learning,Machine-Learning,[Machine-Learning]

In [217]:
df["joined"] = df["split"].apply(lambda x : ',' .join(x))
df

,Text,lower,Upper,capitalise,Title,strip,split,joined
0,Hello_World,hello_world,HELLO_WORLD,Hello_world,Hello_World,Hello_World,[Hello_World],Hello_World
1,Python$pandas,python$pandas,PYTHON$PANDAS,Python$pandas,Python$Pandas,Python$pandas,[Python$pandas],Python$pandas
2,Datascience is cool !!!,datascience is cool !!!,DATASCIENCE IS COOL !!!,datascience is cool !!!,Datascience Is Cool !!!,Datascience is cool !!!,"[Datascience, is, cool, !!!]","Datascience,is,cool,!!!"
3,Machine-Learning,machine-learning,MACHINE-LEARNING,Machine-learning,Machine-Learning,Machine-Learning,[Machine-Learning],Machine-Learning

In [231]:
df["Text"].str.startswith("Python")

0    False
1     True
2    False
3    False
Name: Text, dtype: bool

In [235]:
df["Text"].str.endswith("!!!")

0    False
1    False
2     True
3    False
Name: Text, dtype: bool

In [243]:
df["Text"].str.extract(r'(\w+)')

             0
0  Hello_World
1       Python
2  Datascience
3      Machine

In [251]:
shp_df = pd.read_csv("bigmart.csv")
shp_df.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [253]:
shp_df["Item_Fat_Content"].str.title().unique()

array(['Low Fat', 'Regular', 'Lf', 'Reg'], dtype=object)

In [255]:
sub_dict = {
    'Low Fat': 'Low Fat',
'Lf':'Low Fat',
'Regular':'Regular',
   'Reg' : 'Regular'
}

In [257]:
shp_df["Item_Fat_Content"]=shp_df["Item_Fat_Content"].str.title().replace(sub_dict)

In [259]:
shp_df["Item_Fat_Content"].str.title().unique()

array(['Low Fat', 'Regular'], dtype=object)

In [261]:
shp_df["Item_Fat_Content"].value_counts()

Item_Fat_Content
Low Fat    5517
Regular    3006
Name: count, dtype: int64